{
  "Alohomora": {
    "spellName": "Alohomora",
    "commonName": "The Unlocking Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Instantaneous",
    "tag": null,
    "description": "Choose a door or window that you can see within range, that uses mundane or magical means to prevent access.\r\n\r\nA target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the object has multiple locks, only one of them is unlocked.\r\n\r\nIf you choose a target that is held shut with Colloportus, that spell is removed.\r\n\r\nWhen you cast the spell, the mechanism noisily turns and unlocks. This noise emanates from the target object and is audible from as far away as 100 feet."
  },
  "Point Me": {
    "spellName": "Point Me",
    "commonName": "The Four-Point Spell",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": "Self",
    "duration": "Instantaneous",
    "tag": null,
    "description": "Often used as an investigative tool in wizarding crimes, this spell produces a ghostly recreation of the previous spell cast by the currently used wand. If the previously cast spell cannot be represented visually, you learn the incantation that was used, regardless of whether the incantation was spoken aloud at the time of casting. This spell can be cast a total of three consecutive times on a single wand, revealing the three most recently cast spells."
  },
  "Incendio Glacia": {
    "spellName": "Incendio Glacia",
    "commonName": "The Bluebell Flames Spell",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": "Touch",
    "duration": "One Hour",
    "tag": null,
    "description": "A flickering blue flame flows out from the tip of your wand, condensing on an object, in a container, or in your hand. The flame remains there for the duration and only emanates heat directly upwards. It doesn't harm anything beneath or around it, and seems to hover slightly above whatever it's resting upon. If placed beneath a flammable object, a natural fire may be started from the heat.\r\n\r\nThe flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action."
  },
  "Devicto": {
    "spellName": "Devicto",
    "commonName": "The Stinging Jinx",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Instantaneous",
    "tag": null,
    "description": "This weak jinx is a classic training spell between duelists, a startling sting on impact. Make a ranged spell attack against a creature within range. On a hit, it takes 1d6 force damage, and it can't take reactions until the start of its next turn.\r\n\r\nThe spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
  },
  "Specialis Revelio": {
    "spellName": "Specialis Revelio",
    "commonName": "The Spell Revealing Spell",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": "Touch",
    "duration": "Instantaneous",
    "tag": null,
    "description": "You tap your wand on an object or area, revealing magical influences. If it is a magic item or some other magic-imbued object, you learn its properties and how to use them, whether it requires attunement to use, and how many charges it has, if any. You learn whether any spells are affecting the item and what they are. If the item was created by a spell, you learn which spell created it.                                                                                       If cast on an area, you learn what spells, if any, are currently active within a 5-foot cube in front of you. The border of each spell's effect is illuminated within that cube, much like blowing dust through laser beams."
  },
  "Inanimatus Conjurus": {
    "spellName": "Inanimatus Conjurus",
    "commonName": "Conjuration Incantation",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 10,
    "duration": "One Hour",
    "tag": null,
    "description": "You conjure up an inanimate object in your hand or in an unoccupied space within range that you can see. This object can be no larger than 2 feet on a side and weigh no more than 10 pounds, and its form must be that of a nonmagical object that you have seen.\r\n\r\nThe object disappears at the end of the spell's duration or if it takes any damage.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you may select or stack one of the following effects for each slot level above 1st.\r\n\r\nIncrease the side length by 2 feet.\r\nIncrease the weight limit by 10 pounds."
  },
  "Protego": {
    "spellName": "Protego",
    "commonName": "The Shield Charm",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": "Self",
    "duration": "Ten Minutes",
    "tag": "Defensive",
    "description": "An invisible barrier of magical force appears in front of you and protects you. For the duration, you have a +5 bonus to AC, including against the triggering attack. If you are targeted by a spell that requires an attack roll and the spell's level is equal to or lower than half your proficiency bonus, the spell has no effect on you.\r\n\r\nYou can use a bonus action to change which direction the shield is facing. If you are attacked from either of your sides or from behind while casting this spell, you must use your reaction to redirect the shield to point towards the threat. Otherwise, this spell doesn't protect you."
  },
  "Petrificus Totalus": {
    "spellName": "Petrificus Totalus",
    "commonName": "The Full Body-Bind Curse",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "One Minute",
    "tag": null,
    "description": "This spell makes a being's arms and legs snap together, and it will fall down, stiff as a board. Make a ranged spell attack against a being within range. On a hit, the target is knocked prone and paralyzed for the duration.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you can target a beast instead of a being."
  },
  "Saggitario": {
    "spellName": "Saggitario",
    "commonName": "The Arrow-Shooting Spell",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 150,
    "duration": "Instantaneous",
    "tag": "Dark",
    "description": "A conjured arrow streaks toward a designated target. Make a ranged spell attack against a target within range. On a hit, the target takes piercing damage equal to 1d8 + your spellcasting ability modifier.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you conjure one additional arrow for each slot level above 1st. You can direct the arrows at the same target or at different ones. Make a separate attack roll for each arrow."
  },
  "Accio": {
    "spellName": "Accio",
    "commonName": "The Summoning Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 30,
    "duration": "Instantaneous",
    "tag": null,
    "description": "A target object is pulled directly to the caster as if carried by an invisible hand. The object is selected by pointing at it with a wand or by naming it, Accio broom. An object heavier than 20 pounds may not be summoned.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 1st level or higher, you may select or stack one of the following effects for each slot level above 0.\r\n\r\nIncrease spell range by 100 feet.\r\nIncrease weight limit to 40 pounds.\r\nTarget up to 5 identical objects in range."
  },
  "Bombarda": {
    "spellName": "Bombarda",
    "commonName": "The Exploding Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Instantaneous",
    "tag": "Dark",
    "description": "The spell blasts whatever it hits, creating a localized concussive explosion upon impact. Make a ranged spell attack against a target within range. On a hit, the target takes 1d10 bludgeoning damage.\r\n\r\nThis spell’s damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10)."
  },
  "Carpe Retractum": {
    "spellName": "Carpe Retractum",
    "commonName": "The Seize and Pull Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Six Seconds",
    "tag": null,
    "description": "A bond of light shoots out from the caster and attaches to the target, and then retracts, pulling each side 10 feet closer. If one side doesn't move, the other side moves 20 feet. After retracting, the bond of light keeps the caster and target attached for the duration.                                                                                                                                               At Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the range and pulling effect both increase by 10 feet for each slot level above 0."
  },
  "Duro": {
    "spellName": "Duro",
    "commonName": "The Hardening Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "One Minute",
    "tag": null,
    "description": "An object becomes as hard and tough as stone. It gains resistance to all damage."
  },
  "Pereo ": {
    "spellName": "Pereo",
    "commonName": "The Extinguishing Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 30,
    "duration": "Instantaneous",
    "tag": null,
    "description": "You choose a flame that you can see within range and that fits within a 5-foot cube. You instantaneously extinguish the flames within the cube."
  },
  "Molliare": {
    "spellName": "Molliare",
    "commonName": "The Cushioning Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": "Touch",
    "duration": "One Hour",
    "tag": null,
    "description": "This comfortable charm is most commonly found on a broomstick. One object you touch with your wand is wrapped in an invisible cushioning effect for the duration, almost like two magnets repelling one another."
  },
  "Wingardium Leviosa": {
    "spellName": "Wingardium Leviosa",
    "commonName": "The Levitation Charm",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 30,
    "duration": "One Minute",
    "tag": null,
    "description": "One creature other than yourself or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 100 pounds. An unwilling creature that succeeds on a Constitution saving throw is unaffected.\r\n\r\nThe target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target’s altitude by up to 20 feet in either direction on your turn. Otherwise, you can use your action to move the target, which must remain within the spell’s range.\r\n\r\nIf the spell is ended voluntarily, the target floats gently to the ground if it is still aloft. If ended involuntarily, the target immediately drops.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the weight limit is increased by 150 pounds for each slot level above 0."
  },
  "Episkey": {
    "spellName": "Episkey",
    "commonName": "The Fast-Healing Spell",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 10,
    "duration": "Instantaneous",
    "tag": null,
    "description": "A being of your choice that you can see within range regains hit points equal to 2d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above 1st."
  },
  "Incendio": {
    "spellName": "Incendio",
    "commonName": "The Fire-Making Spell",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 90,
    "duration": "One Minute",
    "tag": "Dark",
    "description": "You create a bonfire on ground that you can see within range. Until the spell ends, the bonfire fills a 5-foot cube. Any creature in the bonfire’s space when you cast the spell must succeed on a Dexterity saving throw. It takes 3d6 fire damage on a failed save, or half as much damage on a successful one. A creature must also make the saving throw when it moves into the bonfire’s space for the first time on a turn or ends its turn there.\r\n\r\nThe bonfire ignites flammable objects in its area that aren’t being worn or carried. If there is adequate fuel for the bonfire to burn, it will continue burning after the spell ends.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 2d6 for each slot level above 2nd."
  },
  "Glacius": {
    "spellName": "Glacius",
    "commonName": "The Water-Freezing Charm",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Instantaneous or Ritual of One Hour",
    "tag": null,
    "description": "You freeze an area of water that you can see within range and that fits within a 5-foot cube. The area becomes difficult terrain for the duration. Each Medium or smaller creature that is covered, submerged or partially submerged in the affected water has its speed halved and must make a Constitution saving throw. On a failed save, a creature takes 3d8 cold damage, or half as much damage on a successful one.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 and the cube's size increases by 5 feet for each slot level above 1st. If a creature of any size fits within the larger cube, it can be affected by this spell."
  },
  "Densaugeo": {
    "spellName": "Densaugeo",
    "commonName": "The Bucktooth Hex",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Instantaneous",
    "tag": null,
    "description": "A target's front two teeth grow abnormally long, protruding downwards past its chin. Make a ranged spell attack against a creature within range. On a hit, it takes 2d8 psychic damage and has disadvantage on the next attack roll it makes before the end of its next turn.       At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage is increased by 1d8 for each slot level above 1st."
  },
  "Diffindo": {
    "spellName": "Diffindo",
    "commonName": "The Severing Charm",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 30,
    "duration": "Instantaneous",
    "tag": null,
    "description": "An object is precisely torn or cut, as if a magical blade extended from the tip of your wand. This spell was not designed to be used on creatures and only makes very shallow cuts. Choose a target that fits within a 5-foot cube. If the target is a creature, it must make a Dexterity saving throw. It takes 4d4 slashing damage on a failed save or half as much damage on a successful one. This is the counterspell to incarcerous, immediately ending that spell's effects.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature or the cube's size increases by 5 feet for each slot level above 1st. If targeting an additional creature, the targets must be within 10 feet of each other when you target them."
  },
  "Mobillicorpus": {
    "spellName": "Mobillicorpus",
    "commonName": "The Carrying Charm",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": 30,
    "duration": "One Hour",
    "tag": null,
    "description": "One willing being of your choice that you can see within range rises 3 feet off the ground, and remains suspended there for the duration as if it were hoisted by invisible ropes under its arms. The spell can levitate a target that weighs up to 500 pounds. If more weight than the limit is placed on top of the being, the spell ends, and it falls to the ground.\n\nThe being is immobile while you are within 20 feet of it. If you move more than 20 feet away from it, the being follows you so that it remains within 20 feet of you. It can move across uneven terrain, up or down stairs, slopes and the like, but it can't cross an elevation change of 10 feet or more. For example, the being can't move across a 10-foot-deep pit, nor could it leave such a pit if it was created at the bottom.\n\nIf you move more than 100 feet from the being (typically because it can't move around an obstacle to follow you), the spell ends."
  },
  "Vera Verto": {
    "spellName": "Vera Verto",
    "commonName": "The General Transfiguration Incantation",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": "Touch",
    "duration": "Until Dispelled",
    "tag": null,
    "description": "This universal incantation is taught to Hogwarts students in their first Transfiguration class. You transfigure one nonmagical object that fits within a 1-foot cube into another nonmagical object of similar size and mass and of equal or lesser value.                                                     At  Higher Levels. When you cast this spell using a spell slot of 1st level or higher, you may select or stack one of the following effects for each slot level above 0.                                                                                                                                                    Increase the cube size by 2 feet.                                                                                                                                                      Target a living Beast (if unwilling, it must succeed on a Wisdom saving throw to avoid the effect).                                                                        Transfigure into a construct (Duration: Concentration, up to 1 minute)."
  },
  "Epoximise": {
    "spellName": "Epoximise",
    "commonName": "The Sticking Spell",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 30,
    "duration": "One Hour",
    "tag": null,
    "description": "This spell transfigures the surface of an object to become extremely sticky. One object of your choice within range that fits within a 1-foot cube adheres to anything it touches for the duration. If a creature wants to overcome the sticking effect, it can use its action to make a Strength check against your spell save DC. On a success, it can pull the target object free or remove one thing from the target object's surface.\r\n\r\nAt Higher Levels. When you cast this spell using a spell slot of 1st level or higher, the cube's size increases by 1 foot for each slot level above 0."
  },
  "Locomotor Wibbly": {
    "spellName": "Locomotor Wibbly",
    "commonName": "The Jelly-Legs Jinx",
    "level": 0,
    "year": 1,
    "castingTime": 1,
    "range": 60,
    "duration": "Instantaneous",
    "tag": null,
    "description": "This will make a person's legs so unsteady and weak that they aren't able to keep their balance. Make a ranged spell attack against a being within range. On a hit, the target is knocked prone."
  },
  "Perfusorius": {
    "spellName": "Perfusorius",
    "commonName": "The Feather-Light Charm",
    "level": 1,
    "year": 1,
    "castingTime": 1,
    "range": "Touch",
    "duration": "Instantaneous or Ritual of One Hour",
    "tag": null,
    "description": "This spell alters an object of up to 500 pounds, changing its weight to be just barely heavier than the atmosphere around it. The slightest force is needed to move, pick up, or carry this object for the duration. It can be easily thrown as well."
  }
}
